EDT/УТ/src/Catalogs/новаТочкиДоставки/новаТочкиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТочкиДоставки</name>
  <attributes>
    <name>ВладелецТочки</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребывания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаПланирования</name>
    <type>
      <types>CatalogRef.новаСменыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособыДоставкиЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПосещения</name>
    <type>
      <types>CatalogRef.новаРежимыПосещенияТочекДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Радиус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонПогрузкиРазгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахождениеТранспортаВРадиусе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.новаПриоритетыТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИзЯндекса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Москва</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикРаботы</name>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПребывания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемВывоза</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.новаНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <types>CatalogRef.новаЕдиницыНоменклатуры</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ЛогПривязкиАдресов/ЛогПривязкиАдресов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогПривязкиАдресов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнаяПривязка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТочкаДоставки</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/новаРайоныАдресов/новаРайоныАдресов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаРайоныАдресов</name>
  <dimensions>
    <name>Классификатор</name>
    <type>
      <types>CatalogRef.новаКлассификаторРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УказанВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Район</name>
    <type>
      <types>CatalogRef.новаГеоРайоны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыЗаказа/ДополнительныеПараметрыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыЗаказа</name>
  <resources>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтклоненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </resources>
  <resources>
    <name>ЧастичныйВыкупЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОжиданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентомИзмененное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>okey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>nameOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодъемОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасстояниеОтБазыПоДорогам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоСопоставленияКатегории</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДСФЗПоДоставке</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </resources>
  <resources>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъемаЗаказа</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ТарифнаяСеткаПодъемаЗаказов</name>
    <type>
      <types>CatalogRef.ТарифыПодъемаЗаказовНаЭтаж</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП_Миго</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>СхемаЛогистическихБрейков</name>
    <type>
      <types>CatalogRef.СхемыЛогистическихБрейков</types>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийБрейк</name>
    <type>
      <types>CatalogRef.ЛогистическиеБрейки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательЗаказа</name>
    <type>
      <types>CatalogRef.ПолучателиЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПредъявлениеУдостоверяющегоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифРасчетаСтоимостиДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НегабаритныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Агрегатор</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </resources>
  <resources>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПВЗ</name>
    <type>
      <types>CatalogRef.ПунктыПВЗ</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияЗаказа</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаОтслеживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСозданияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ГабаритнаяХарактеристикаОпределенияЛогБрейка</name>
    <type>
      <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/новаТочкиДоставки/Forms/ФормаЭлементаУпр/Module.bsl
&НаКлиенте
Процедура НайтиАдрес(Команда)
	
	СтрПараметров = Новый Структура;
	Если ПолучитьНаименованиеАдреса() = "" Тогда
		СтрПараметров.Вставить("Адрес",Объект.Наименование);
	Иначе
		СтрПараметров.Вставить("Адрес",ПолучитьНаименованиеАдреса());
	КонецЕсли;
	ОткрытьФорму("Обработка.новаПоискАдреса.Форма.ФормаУпр",СтрПараметров,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеАдреса()
	Возврат Объект.Адрес.Наименование;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыбранАдрес" Тогда
		Если Источник.ВладелецФормы = ЭтаФорма Тогда
			ВыполнитьПодстановкуАдреса(Параметр);
			Модифицированность = Истина;
			
			РайоныАдресов.Отбор.Элементы.Очистить();
			ЭлементОтбораСчета = РайоныАдресов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбораСчета.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Адрес"); 
			ЭлементОтбораСчета.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбораСчета.Использование = Истина; 
			ЭлементОтбораСчета.ПравоеЗначение = Объект.Адрес;

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьПодстановкуАдреса(обАдрес)
	
	Объект.Наименование = ОбАдрес.Наименование;
	Объект.Адрес = обАдрес;
	
	ТекВр = ТекущаяДата();
	Наб = РегистрыСведений.ЛогПривязкиАдресов.СоздатьНаборЗаписей();
	Наб.Отбор.ТочкаДоставки.Установить(Объект.Ссылка);
	Наб.Отбор.Период.Установить(ТекВр);
	
	Нов = Наб.Добавить();
	Нов.Период = ТекВр;
	Нов.ТочкаДоставки = Объект.Ссылка;
	Нов.Адрес = ОбАдрес.Наименование;
	Нов.РучнаяПривязка = Истина;
	Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Наб.Записать();
	
	//НастроитьПоляАдреса();
	
	НаборЗаписей = РегистрыСведений.новаРайоныАдресов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Адрес.Установить(обАдрес.Ссылка);
	НаборЗаписей.Прочитать();
	ГеоРайоны = НаборЗаписей.Выгрузить();
	
	// Михушкин --->> 
	//ищем БП местная доставка
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаборТовара") Тогда
		Если НадоПроизводитьПоискПолигона Тогда
			Если ЗначениеЗаполнено(обАдрес.Долгота) И ЗначениеЗаполнено(обАдрес.Широта) Тогда
				МассивСтрук = Новый Массив;
				
				Струк = Новый Структура;
				
				Струк.Вставить("НомерЗаказа", Число(СокрЛП(Заказ.Номер)));
				Струк.Вставить("Широта", обАдрес.Широта);
				Струк.Вставить("Долгота", обАдрес.Долгота);
				МассивСтрук.Добавить(Струк);
				
				//+Широков 24.12.2020 по письму
				//ПолигональнаяМаршрутизацияСервер.ПолучитьПолигоныЗаказов(МассивСтрук);	
				ПолигональнаяМаршрутизацияСервер.ПолучитьПолигоныЗаказов(МассивСтрук, Неопределено, "Справочник.новаТочкиДоставки.ФормаЭлементаУпр.ВыполнитьПодстановкуАдреса(84, 5)");	
				//-Широков 24.12.2020 по письму
				
				//Асеев 14.10.2022 (Задача № 4913)>>>
				МассивЗаказовЗон = Новый Массив;
				МассивЗаказовЗон.Добавить(Заказ);
				ТарификацияУслугСервер.УстановитьЗонуЗаказов(МассивЗаказовЗон);
				//Асеев 14.10.2022 (Задача № 4913)<<<
			КонецеСли;
		КонецеСли;
	Иначе	
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	новаМестнаяДоставка.Ссылка КАК Ссылка,
		|	новаМестнаяДоставка.Номер КАК Номер,
		|	новаМестнаяДоставка.ТочкаОтправления КАК ТочкаОтправления
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		|ГДЕ
		|	новаМестнаяДоставка.ТочкаПрибытия = &ТочкаПрибытия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВТ.Номер КАК Номер,
		|	ВТ.ТочкаОтправления КАК ТочкаОтправления,
		|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
		|	РеализацияТоваровУслуг.Номер КАК НомерЗаказа
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВТ.Номер = РеализацияТоваровУслуг.Номер
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Заказ");
		Запрос.УстановитьПараметр("ТочкаПрибытия", Объект.Ссылка);	
		//mel добавление отбора по заказу 07.02.2018
		Запрос.УстановитьПараметр("Заказ", Заказ);	
		//mel добавление отбора по заказу 07.02.2018
		
		Рез = Запрос.Выполнить().Выбрать();
		
		
		
		РасстояниеПоДорогам = 0;
		
		Пока Рез.Следующий() Цикл	
			
			//mel установка полигонального адреса 07.02.2018
			Если НадоПроизводитьПоискПолигона Тогда
				Если ЗначениеЗаполнено(обАдрес.Долгота) И ЗначениеЗаполнено(обАдрес.Широта) Тогда
					МассивСтрук = Новый Массив;
					
					Струк = Новый Структура;
					
					Струк.Вставить("НомерЗаказа", Число(Рез.НомерЗаказа));
					Струк.Вставить("Широта", обАдрес.Широта);
					Струк.Вставить("Долгота", обАдрес.Долгота);
					МассивСтрук.Добавить(Струк);
					
					//+Широков 24.12.2020 по письму
					//ПолигональнаяМаршрутизацияСервер.ПолучитьПолигоныЗаказов(МассивСтрук);
					ПолигональнаяМаршрутизацияСервер.ПолучитьПолигоныЗаказов(МассивСтрук, Неопределено, "Справочник.новаТочкиДоставки.ФормаЭлементаУпр.ВыполнитьПодстановкуАдреса(137, 6)");
					//-Широков 24.12.2020 по письму
					
					//Асеев 14.10.2022 (Задача № 4913)>>>
					МассивЗаказовЗон = Новый Массив;
					МассивЗаказовЗон.Добавить(Заказ);
					ТарификацияУслугСервер.УстановитьЗонуЗаказов(МассивЗаказовЗон);
					//Асеев 14.10.2022 (Задача № 4913)<<<
					
					//++Задача № 3303
					ЗаказКОбработкеПоСменам = Новый Массив;
					ЗаказКОбработкеПоСменам.Добавить(Заказ);
					МаршрутизацияЗаказовСервер.УстановкаСменыДляЗаказов(ЗаказКОбработкеПоСменам);
					//--Задача № 3303
				КонецеСли;
			КонецеСли;
			//mel установка полигонального адреса 07.02.2018
			
			
			// рассчитаем расстояние
			Если ЗначениеЗаполнено(Рез.ТочкаОтправления.Адрес) И ЗначениеЗаполнено(Объект.Адрес) Тогда					
				РасстояниеПоДорогам = РаботаСГеокодированием.ПолучитьРасстояниеПоДорогам_GoogleAPI(Рез.ТочкаОтправления.Адрес.Широта, Рез.ТочкаОтправления.Адрес.Долгота, Объект.Адрес.Широта, Объект.Адрес.Долгота);
			КонецЕсли;
			
			// сделаем запись в РС ДопПараметры
			Если ЗначениеЗаполнено(РасстояниеПоДорогам) Тогда
				Набор = РегистрыСведений.ДополнительныеПараметрыЗаказа.СоздатьНаборЗаписей();
				Набор.Отбор.Заказ.Установить(Рез.Заказ);
				Набор.Прочитать();
				Если Набор.Количество() Тогда			
					Для каждого Стр Из Набор Цикл					
						Стр.РасстояниеОтБазыПоДорогам = РасстояниеПоДорогам;	
					КонецЦикла;		
				Иначе
					НЗапись = Набор.Добавить();
					НЗапись.РасстояниеОтБазыПоДорогам = РасстояниеПоДорогам;
				КонецЕсли;	
				
				Попытка
					Набор.Записать();	
				Исключение				
				КонецПопытки;					
			КонецЕсли;		
			
		КонецЦикла;	
	КонецеСли;
	// <<--- Михушкин 			
	


КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Закрыть(Объект.Ссылка);
	//ОповеститьОВыборе(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если не новаУправлениеПользователями.ПользовательИмеетПравоРаботатьСКСЛ() Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	Если Объект.ГрафикРаботы.Количество() = 0 Тогда
		Для ъ = 1 По 5 Цикл
			стрГрафикРаботы = Объект.ГрафикРаботы.Добавить();
			стрГрафикРаботы.ВремяНачала = '00010101080000';
			стрГрафикРаботы.ВремяОкончания = '00010101200000';
			стрГрафикРаботы.ВремяПребывания = '00010101003000';
		КонецЦикла;
	
		Для ъ = 1 По 2 Цикл
			стрГрафикРаботы = Объект.ГрафикРаботы.Добавить();
			стрГрафикРаботы.Выходной = Истина;
		КонецЦикла;
	КонецЕсли;
	
	РайоныАдресов.Отбор.Элементы.Очистить();
	ЭлементОтбораСчета = РайоныАдресов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбораСчета.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Адрес"); 
	ЭлементОтбораСчета.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбораСчета.Использование = Истина; 
	ЭлементОтбораСчета.ПравоеЗначение = Объект.Адрес;
	

КонецПроцедуры

&НаКлиенте
Процедура РайоныАдресовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
